# NoTargetsForDependentViewPropagation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ViewFailures..::..NoTargetsForDependentViewPropagation Property
BuiltInFailures..::..ViewFailures Class See Also
---
There are no valid views. Only views without dependents can be used.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoTargetsForDependentViewPropagation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoTargetsForDependentViewPropagation As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoTargetsForDependentViewPropagation {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ViewFailures Class
Autodesk.Revit.DB Namespace